In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("titanic.csv")

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [14]:
df.drop(['Name','Cabin','Ticket'],axis=1,inplace=True)

In [15]:
df.head()

   PassengerId  Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0            1         0       3    male  22.0      1      0   7.2500        S
1            2         1       1  female  38.0      1      0  71.2833        C
2            3         1       3  female  26.0      0      0   7.9250        S
3            4         1       1  female  35.0      1      0  53.1000        S
4            5         0       3    male  35.0      0      0   8.0500        S

In [17]:
from sklearn.preprocessing import LabelEncoder

In [18]:
encoder=LabelEncoder()

In [19]:
df['EmbarkedN']=encoder.fit_transform(df['Embarked'])

In [20]:
df['SexN']=encoder.fit_transform(df['Sex'])

In [21]:
df.drop(['Sex','Embarked'],axis=1,inplace=True)

In [31]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Age            177
SibSp            0
Parch            0
Fare             0
EmbarkedN        0
SexN             0
dtype: int64

In [34]:
df['Age'].fillna(df['Age'].median(),inplace=True)

In [35]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Age            0
SibSp          0
Parch          0
Fare           0
EmbarkedN      0
SexN           0
dtype: int64

In [27]:
df.head()

   PassengerId  Survived  Pclass   Age  SibSp  Parch     Fare  EmbarkedN  SexN
0            1         0       3  22.0      1      0   7.2500          2     1
1            2         1       1  38.0      1      0  71.2833          0     0
2            3         1       3  26.0      0      0   7.9250          2     0
3            4         1       1  35.0      1      0  53.1000          2     0
4            5         0       3  35.0      0      0   8.0500          2     1

In [36]:
from sklearn import tree

In [56]:
model=tree.DecisionTreeClassifier(criterion='entropy')

In [57]:
from sklearn.model_selection import train_test_split

In [82]:
x_train,x_test,y_train,y_test=train_test_split(df[df.columns[2:9]],df.Survived,test_size=0.3)

In [83]:
model.fit(x_train,y_train)

DecisionTreeClassifier(criterion='entropy')

In [84]:
model.score(x_test,y_test)

0.8134328358208955